GetSP14133302014
Syntax
SapObject.SapModel.Func.FuncRS.GetSP14133302014
VB6 Procedure
Function GetSP14133302014(ByVal Name As String, ByRef Direction As Long, ByRef Seismicity As Long, ByRef SoilCat As Long, ByRef K0Factor As Double, ByRef K1Factor As Double, ByRef KPsiFactor As Double, ByRef NonlinSoil As Boolean, ByRef ASoil As Double, ByRef DampRatio As Double) As Long
Parameters
Name
The name of a SP 14.13330.2014 response spectrum function.
Direction
This is 1, 2, 3, or 4, indicating the direction and structure type for which the response spectrum is generated.
1 = Building Horizontal
2 = Building Vertical
3 = Bridge Horizontal
4 = Bridge Vertical
Seismicity
This is 1, 2, 3, or 4, indicating the region seismicity of the construction site.
1 = 6
2 = 7
3 = 8
4 = 9
SoilCat
This is 1, 2, 3, or 4, indicating the soil category.
1 = I
2 = II
3 = III
4 = IV
K0Factor
The K0Factor, 0 < K0 <= 2.0. This is only applicable when the Direction parameter is 1 or 3 for horizontal spectra.
K1Factor
The K1Factor, 0 < K1 <= 1.0.
KPsiFactor
The KPsiFactor, 0.5 < KPsi <= 1.5. This is only applicable when the Direction parameter is 1 or 3 for horizontal spectra.
NonlinSoil
This item is True if nonlinear soil deformation should be accounted for. This is only applicable when the Direction parameter is 1 or 2 for buildings and the SoilCat parameter is 3 or 4.
ASoil
The nonlinear soil deformation factor, 0 > a_soil <= 1.0. This is only applicable when the NonlinSoil parameter is True, the Direction parameter is 1 or 2 buildings, and the SoilCat parameter is 3 or 4.
DampRatio
The damping ratio for the function, 0 <= DampRatio < 1.
Remarks
This function retrieves the definition of a SP 14.13330.2014 response spectrum function.
The function returns zero if the function is successfully retrieved; otherwise it returns a nonzero value.
VBA Example
Sub GetRSFuncSP14133302014()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim Direction As Long
 Dim Seismicity As Long
 Dim SoilCat As Long
 Dim K0Factor As Double
 Dim K1Factor As Double
 Dim KPsiFactor As Double
 Dim NonlinSoil As Boolean
 Dim ASoil As Double
 Dim DampRatio As Double
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'add SP 14.13330.2014 RS function
 ret = SapModel.Func.FuncRS.SetSP14133302014("RS-1", 1, 2, 2, 1.0, 0.25, 1.0, False, 0.7, 0.04)
 'get SP 14.13330.2014 RS function
 ret = SapModel.Func.FuncRS.GetSP14133302014("RS-1", Direction, Seismicity, SoilCat, K0Factor, K1Factor, KPsiFactor, NonlinSoil, ASoil, DampRatio)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 18.2.0.
See Also
SetSP14133302014